import { z } from "zod";

export const step4AnswerSchema = z.object({
  economic: z.string().default(""),
  social: z.string().default(""),
  environment: z.string().default(""),
});

export const step4QuestionSchema = z.object({
  title: z.string(),
  with: step4AnswerSchema,
  without: step4AnswerSchema,
});

export const step4Schema = z.array(step4QuestionSchema);

export type Step4Schema = z.infer<typeof step4Schema>;

export const step4DefaultValues = [];
export const step4DefaultValuesMocked = [
  {
    title: "ระบบการค้นหาและสอบทานข้อมูลคนจนเป้าหมาย",
    with: {
      economic:
        "ระบบการค้นหาและสอบทานข้อมูลที่แม่นยำ เมื่อมีโครงการฯทำให้จังหวัดชัยนาทมีกลไกขับเคลื่อนการแก้ปัญหาความยากจนแบบมีส่วนร่วมโดยนักจัดการข้อมูลชุมชน และภาคีเครือข่ายการพัฒนาที่เกี่ยวข้อง มีระบบข้อมูลคนจนเป้าหมายที่ระบุถึงปัญหา และความต้องการที่แม่นยำ สามารถส่งต่อข้อมูลให้แก่หน่วยงานตามภารกิจให้ความช่วยเหลือได้รวดเร็วและตรงเป้ามากขึ้น หน่วยงานเชิงนโยบายสามารถนำข้อเสนอแนะเกณฑ์การจำแนกแยกแยะครัวเรือนคนจนตกหล่น และครัวเรือนรั่วไหล ไปใช้ในการปรับปรุงการจัดทำระบบฐานข้อมูลคนจนของประเทศต่อไปได้ การส่งต่อความช่วยเหลือ เมื่อมีโครงการฯข้อมูลคนจนเป้าหมายที่ผ่านการสอบทานแล้ว ได้ส่งต่อให้แก่หน่วยงานภารกิจให้ความช่วยเหลือได้ตรงเป้าตรงประเด็น และรวดเร็ว",
      social:
        "ระบบการค้นหาและสอบทานข้อมูลที่แม่นยำและการส่งต่อความช่วยเหลือเมื่อโครงการฯ ทำให้เกิดการรวมกลุ่มของผู้นำชุมชน ท้องที่ ท้องถิ่น มาร่วมกับโครงการวิจัยในการพัฒนาศักยภาพนักจัดการข้อมูลชุมชน ทำให้เกิดความเข้าใจสถานการณ์ความยากจน และเกิดความสามัคคี มีการให้ความช่วยเหลือได้ตรงเป้ามากขึ้น เป็นคนกลางที่เชื่อมการทำงานระหว่างหน่วยงานภารกิจกับ คนจนที่ต้องการความช่วยเหลือ",
      environment: "-",
    },
    without: {
      economic:
        "ระบบการค้นหาและสอบทานข้อมูลที่แม่นยำ ถ้าไม่มีโครงการฯหน่วยงานรัฐจะต้องใช้งบประมาณและระยะเวลาในการจัดเก็บข้อมูลคนจน และไม่เป็นปัจจุบัน ปัญหาและความต้องการเร่งด่วนไม่สามารถเข้าถึงความช่วยเหลือได้ทันที เกิดความล่าช้า และตกหล่น การส่งต่อความช่วยเหลือ ถ้าไม่มีโครงการฯคนจนที่ตกสำรวจจะไม่ได้รับความช่วยเหลือตามสิทธิที่พึงมีพึงได้",
      social:
        "ระบบการค้นหาและสอบทานข้อมูลที่แม่นยำและการส่งต่อความช่วยเหลือถ้าไม่มีโครงการฯ ชุมชนไม่มีการรวมกลุ่มของผู้นำชุมชน เป็นนักจัดการข้อมูลชุมชนที่จะเป็นโซ่ข้อกลาง ระหว่างหน่วยงานภารกิจ กับคนจนที่ต้องการความช่วยเหลือ",
      environment: "-",
    },
  },
  {
    title: "ปฏิบัติการแก้จนกลุ่มปุ๋ยหปฏิบัติการแก้จนกลุ่มปุ๋ยหมักมูลแพะ (ปุ๋ยอินทรีย์ วิถีชัยนาท ปุ๋ยแห่งโอกาส)",
    with: {
      economic:
        "เมื่อมีปฏิบัติการแก้จนกลุ่มปุ๋ยหมักมูลแพะฯ ทำให้ชุมชนเกิดห่วงโซ่การประอบการปุ๋ยหมักมูลแพะ ต่อยอดเป็นชุดพร้อมปลูก แบรนด์ Pho-G และจัดตั้งเป็นกลุ่มวิสาหกิจกลุ่มพัฒนาอาชีพตำบลโพงาม คนจนมีงานทำ มีรายได้ และมีคุณภาพชีวิตที่ดีขึ้น ช่วยลดรายจ่ายในครัวเรือน ชุมชนเริ่มหันมาใช้ปุ๋ยหมักมูลแพะ (ปุ๋ยอินทรีย์) สามารถลดต้นทุนทำการเกษตร เป็นต้นแบบขยายผลไปดำเนินการในพื้นที่ และกลุ่มเป้าหมายอื่นได้",
      social:
        "เมื่อมีปฏิบัติการแก้จนกลุ่มปุ๋ยหมักมูลแพะฯ โครงสร้างทางสังคมในชุมชนเข้มแข็ง กลุ่มอาชีพและชุมชนมีการช่วยเหลือเกื้อกูลซึ่งกันและกัน ผู้ประกอบการเลี้ยงแพะรายใหญ่เกื้อกูลสังคม ส่งต่อมูลแพะให้วิสากิจกลุ่มอาชีพฯ ไปใช้ประโยชน์",
      environment:
        "เมื่อมีปฏิบัติการแก้จนกลุ่มปุ๋ยหมักมูลแพะฯ ระยะยาวจะช่วยให้ชุมชนลดพื้นที่เสื่อมโทรมอันเกิดจากการทับถมของมูลแพะ ลดผลกระทบจาก PM 2.5 ที่เกิดจากการเผามูลแพะ หรือเผาฟางข้าว",
    },
    without: {
      economic:
        "ถ้าไม่มีโครงการฯ ชุมชนจะไม่มีการรวมกลุ่มจัดตั้งเป็นวิสาหกิจกลุ่มพัฒนาอาชีพตำบลโพงาม และการประกอบการผลิตปุ๋ยหมักมูลแพะ คนจนไม่ได้ทำงานรับจ้าง และไม่มีรายได้เพิ่มขึ้น",
      social:
        "ถ้าไม่มีโครงการฯ ผู้ประกอบการเลี้ยงแพะรายใหญ่ อาจจะมีความขัดแย้งกับคนในชุมชน เนื่องจากการกำจัดมูลแพะไม่ถูกวิธี และไม่ได้นำไปใช้ประโยชน์ ส่งกลิ่นที่ไม่พึงประสงค์ เกิดมลพิษคนจนเป้าหมายที่เป็นผู้สูงอายุไม่มีกิจกรรม อาจเกิดภาวะซึมเศร้าได้",
      environment:
        "ถ้าไม่มีโครงการฯ ชุมชนอาจมีพื้นที่เสื่อมโทรม และได้รับผลกระทบต่อสุขภาพฯ จากการเผามูลแพะ และฟางข้าวทำให้เกิด PM 2.5",
    },
  },
  {
    title: "ปฏิบัติการแก้จนกลุ่มเกษตรแปลงรวมแก้จนคนวัดตึก",
    with: {
      economic:
        "หลังจากมีโครงการนี้ ทำให้เกิดการยกระดับคุณภาพชีวิตของคนจนในครัวเรือนกลุ่มพึ่งพิงและกลุ่มรอการพัฒนา และปัญหาคนจนหมดไป",
      social:
        "หลังมีโครงการนี้ ทำให้เกิดการรวมกลุ่มของคนในชุมชน มีการประชุมหารือ ร่วมคิด ร่วมแก้ปัญหา ร่วมวางแผน และร่วมกันดำเนินกิจกรรมเพื่อประโยชน์ของคนในชุมชน เกิดความรักความสามัคคีในชุมชน หลังมีโครงการนี้ ทำให้การเกื้อกูลมากยิ่งขึ้น ความช่วยเหลือในสังคมมีความยั่งยืน มีการส่งต่อความช่วยเหลือจากกลุ่มรอการพัฒนา โดยการแบ่งปันผักจากแปลงรวมไปยังคนจนกลุ่มพึ่งพิง เกิดความมั่งคงทางอาหาร ทำให้คนจนกลุ่มพึ่งพิงมีรายจ่ายในครัวเรือนลดลง",
      environment:
        "หลังมีโครงการนี้ ทำให้มีการนำที่รกร้างมาใช้ประโยชน์ทำเป็นแปลงปลูกผัก โดยมีคนจนเป้าหมายเข้าร่วมปลูกผัก 15 ครัวเรือน จำนวน 23 คน ทำให้ที่รกร้างเดิมที่บรรยากาศไม่น่ามองกลายเป็นแปลงผักที่อุดมสมบูรณ์ หลังจากมีโครงการฯ การใช้ปุ๋ยหมักมูลแพะในการปลูกพืชผัก ทำให้ลดผลกระทบจากการใช้สารเคมี หลังจากมีความร่วมมือจากภาคีการพัฒนาเข้ามาสนับสนุนระบบสูบน้ำพลังงานแสงอาทิตย์ ทำให้ผู้ปลูกผักเข้าถึงแหล่งธรรมชาติแม่น้ำน้อย (แทนการซื้อน้ำ)",
    },
    without: {
      economic:
        "ถ้าไม่มีโครงการนี้จะไม่มี “กลุ่มเกษตรแปลงรวมแก้จนคนวัดตึก” คนจนกลุ่มพึ่งพิงและกลุ่มรอการพัฒนา ก็ยังมีรายจ่ายสูง รายได้ไม่เพียงพอกับรายจ่าย",
      social:
        "ถ้าไม่มีโครงการนี้ การทำกิจกรรมร่วมกันเพื่อประโยชน์ของคนในชุมชนจะไม่เกิดขึ้น ไม่เกิดการส่งต่อความช่วยเหลือไปยังคนจนกลุ่มพึ่งพิง ความช่วยเหลือเข้าไปไม่ถึงคนจนกลุ่มล่างสุด ไม่เกิดการรวมกลุ่มในชุมชน",
      environment: "ถ้าไม่มีโครงการนี้ จะไม่เกิดการใช้ประโยชน์จากที่ดินว่างเปล่าที่ปล่อยให้รกร้าง",
    },
  },
  {
    title: "ปฏิบัติการแก้จนโครงการพัฒนาห่วงโซ่อุปทานสมุนไพรคุณภาพ",
    with: {
      economic:
        "เมื่อมีโครงการฯ ชุมชนเกิดห่วงโซ่การประกอบการสมุนไพรคุณภาพสูงครบวงจร มีกลุ่มวิสาหกิจปลูกพืชสมุนไพร และกลุ่มวิสาหกิจผลิตผลิตภัณฑ์สมุนไพร ที่บริหารจัดการให้สมาชิกกลุ่มมีอาชีพ มีรายได้ และมีคุณภาพชีวิตที่ดีขึ้น ชุมชนได้ใช้ผลิตภัณฑ์สมุนไพรที่มีคุณภาพ เมื่อมีโครงการฯ มีการนำปุ๋ยหมักจากมูลแพะมาใช้ในการปลูกพืชสมุนไพร เป็นการขยายพื้นที่ปฏิบัติการจำหน่ายปุ๋ยมูลแพะ ทำให้คนจนในห่วงโซ่อาชีพปุ๋ยหมักมูลแพะมีงานทำ และมีรายได้เพิ่มขึ้น",
      social:
        "เมื่อมีโครงการฯ ชุมชนเกิดการรวมกลุ่ม และมีการทำงานร่วมกับนักจัดการข้อมูลชุมชน ส่งผลให้เกิดการช่วยเหลือเกื้อกูลซึ่งกันและกันในชุมชน เมื่อมีโครงการฯ สถาบันการศึกษาได้เชื่อมโยงการทำงานกับหน่วยงานภาคีการพัฒนาหลาย ๆ ด้าน เช่น การตรวจสอบคุณภาพดิน ตรวจสารสำคัญของพืชสมุนไพร เป็นต้น",
      environment:
        "เมื่อมีโครงการฯ ทำให้มีการใช้ปุ๋ยหมักจากมูลแพะ ซึ่งเป็นปุ๋ยอินทรีย์ ทำให้ลดการผลกระทบจากการใช้สารเคมีในชุมชน",
    },
    without: {
      economic:
        "ถ้าไม่มีโครงการฯ ชุมชนจะไม่มีการรวมกลุ่มวิสาหกิจปลูกและแปรรูปพืชสมุนไพร ไม่มีการขยายพื้นที่ปฏิบัติการปุ๋ยหมักมูลแพะ",
      social: "ถ้าไม่มีโครงการฯ ชุมชนไม่เกิดการรวมกลุ่ม และไม่การช่วยเหลือซึ่งกันและกัน",
      environment: "-",
    },
  },
  {
    title: "ปฏิบัติการแก้จนกองทุนข้าวสารเพื่อการดำรงชีพ ตำบลโพนางดำออก",
    with: {
      economic: "ยกระดับคุณภาพชีวิตของคนจนในครัวเรือนเป้าหมายกลุ่มพึ่งพิงให้อยู่ได้",
      social: "หลังมีโครงการฯ ชาวบ้านในชุมชนมีการเกื้อกูล และให้ความช่วยเหลือกันในชุมชน คนจนมีความมั่นคงทางอาหาร",
      environment: "-",
    },
    without: {
      economic:
        "ถ้าไม่มีโครงการนี้จะไม่มีการจัดตั้งกองทุนข้าวสาร “ข้าวโอบรักโมเดล” คนจนจะมีข้าวกินไม่เพียงพอ บางมื้อต้องอดข้าว ต้องนำเงินสวัสดิการที่ได้จากรัฐไปซื้อข้าว ไม่มีเงินไปหาหมอหรือซื้อกับข้าว",
      social:
        "ถ้าไม่มีโครงการนี้ ความช่วยเหลือเข้าไปไม่ถึงคนจน คนจนถูกปล่อยปละละเลย ความช่วยเหลือเข้าไปไม่ถึงคนจนบางกลุ่ม",
      environment: "-",
    },
  },
  {
    title:
      "ถ้าไม่มีโครงการนี้ ความช่วยเหลือเข้าไปไม่ถึงคนจน คนจนถูกปล่อยปละละเลย ความช่วยเหลือเข้าไปไม่ถึงคนจนบางกลุ่ม",
    with: {
      economic:
        "เมื่อมีโครงการฯ ช่วยให้คนจนมีโอกาสในการเข้าถึงบัตรสวัสดิการแห่งรัฐ เพื่อบรรเทาค่าใช้จ่ายในการอุปโภคและบริโภค โดยมีความแม่นยำในฐานข้อมูลเพื่อจัดการกลุ่มเป้าหมายได้อย่างถูกต้อง ช่วยให้การใช้งบประมาณในการช่วยเหลือของภาครัฐมีประสิทธิภาพมากที่สุด จำนวน 1,609 คน",
      social:
        "เมื่อมีโครงการฯ ทำให้คนจนเข้าถึงสวัสดิการรัฐ โดยใช้กลไกเปิดพื้นที่คนในชุมชนที่มีจิตอาสา หรือนักจัดการข้อมูลมีการใช้กระบวนการเพื่อสร้างความสัมพันธ์ และความเข้าใจกลุ่มเป้าหมาย ทำให้กลุ่มที่ตกหล่นได้เข้าสู่ระบบ เป็นโมเดลต้นแบบ “ไม่ทิ้งใครไว้ข้างหลัง” ในการผลักดันกลุ่มเป้าหมายขั้นพื้นฐาน",
      environment: "-",
    },
    without: {
      economic:
        "ถ้าไม่มีโครงการฯ คนจนจริงและอยู่ในภาวะพึ่งพิงอาจจะตกหล่นหรือเข้าไม่ถึงบัตรสวัสดิการแห่งรัฐ และโครงการช่วยเหลืออื่น ๆ ของหน่วยงานภาครัฐ ",
      social:
        "หากไม่มีโครงการฯ ชุมชนจะไม่มีการระดมและจัดระบบสรรพกำลัง/ทรัพยากรการช่วยเหลือ ให้กับกลุ่มเป้าหมาย กลุ่มจิตอาสาในชุมชนไม่มีพื้นที่ในการช่วยเหลือในชุมชน ไม่มีประสบการณ์และองค์ความรู้เพียงพอในการพัฒนาชุมชนของตน และชุมชนอาจไม่เข้าถึงสวัสดิการต่าง ๆ ที่เพียงพอ",
      environment: "-",
    },
  },
];
